[1,0,0,[["cc.JsonAsset",["_name","json"],1]],[[0,0,1,3]],[[0,"protocol",{"protocol":["上海火刀石网络科技有限公司游戏用户协议","","欢迎您使用上海火刀石网络科技有限公司（以下简称 “火刀石科技” 或 “我们”）提供的游戏及相关服务！请您仔细阅读并充分理解本《游戏用户协议》（以下简称 “本协议”）各条款内容，特别是加粗、下划线等提示的条款，其中可能包含限制、免责条款，对您的权利义务产生重大影响。如您对本协议内容有任何疑问，请向我们咨询。","一、定义","游戏：指由火刀石科技开发、运营或经授权运营的游戏产品及相关服务。","用户：指通过合法途径获得火刀石科技游戏账号并使用游戏及相关服务的自然人。","游戏账号：指用户注册后用于登录和使用游戏的账号，包括但不限于用户名、密码等。","二、服务内容","火刀石科技向用户提供游戏的下载、安装、运行、更新等服务，并提供相应的技术支持。","游戏中可能包含虚拟货币、虚拟物品等，用户可通过合法途径获取和使用，具体获取和使用规则以游戏内说明和相关规定为准。","三、用户账号注册与使用","用户注册账号时应提供真实、准确、完整的个人信息，并及时更新。若因提供虚假信息导致任何损失或法律责任，由用户自行承担。","用户应妥善保管账号及密码，不得将账号出租、出借、转让给他人使用。如发现账号被盗用或存在异常情况，应立即通知火刀石科技。","用户在使用账号过程中应遵守法律法规、本协议及游戏规则，不得进行任何违法违规或损害火刀石科技及其他用户权益的行为。","四、用户权利与义务","用户有权在遵守本协议的前提下，按照游戏规则使用游戏及相关服务。","用户应尊重游戏的知识产权，不得对游戏进行反向工程、反编译、反汇编等任何破坏游戏安全性和完整性的行为。","用户在游戏中不得发布任何违法、违规、侵权、淫秽、暴力、侮辱、诽谤等不良信息。","用户应自行承担因使用游戏及相关服务产生的网络费用、设备损耗等费用。","五、隐私保护","火刀石科技将按照相关法律法规和隐私政策的规定，收集、使用、存储和保护用户的个人信息。","未经用户同意，火刀石科技不会向第三方披露用户的个人信息，但法律法规另有规定或为履行本协议义务需要的除外。","六、知识产权","游戏及相关服务中包含的所有知识产权，包括但不限于软件、图像、音乐、文字等，均归火刀石科技或其授权方所有。","用户仅在使用游戏及相关服务的过程中获得有限的使用权，不得擅自复制、传播、修改、演绎游戏内容。","七、服务变更、中断与终止","火刀石科技有权根据业务发展需要、法律法规调整等情况，对游戏及相关服务进行变更、暂停或终止，并将通过合适的方式通知用户。","若用户违反本协议约定，火刀石科技有权暂停或终止用户的账号及相关服务，且无需退还用户已支付的费用。","八、责任限制与免责","火刀石科技将尽力确保游戏及相关服务的稳定性和安全性，但因不可抗力、网络故障、技术问题等原因导致的服务中断、数据丢失等情况，火刀石科技不承担责任。","对于用户在游戏中遭受的任何损失，包括但不限于虚拟财产损失、名誉损失等，火刀石科技仅在法律规定的范围内承担责任。","九、法律适用与争议解决","本协议的签订、履行、解释及争议解决均适用中华人民共和国法律（不包括冲突法）。","如双方在本协议履行过程中发生争议，应首先通过友好协商解决；协商不成的，任何一方均有权向有管辖权的人民法院提起诉讼。","十、其他条款","本协议是用户与火刀石科技之间关于游戏及相关服务的完整协议，取代之前双方的所有口头或书面协议。","本协议的任何条款被认定为无效或不可执行，不影响其他条款的效力和执行。","火刀石科技有权随时修改本协议内容，修改后的协议将在官方渠道公布。如用户在修改后的协议生效后继续使用游戏及相关服务，视为同意接受修改后的协议约束。","感谢您选择使用火刀石科技的游戏及相关服务！希望您在游戏中获得愉快的体验！"],"privacy":["上海火刀石网络科技有限公司游戏隐私政策","","欢迎您使用上海火刀石网络科技有限公司（以下简称 “火刀石科技” 或 “我们”）提供的游戏及相关服务！我们深知保护用户隐私的重要性，因此制定了本隐私政策，旨在向您说明我们如何收集、使用、存储和保护您的个人信息。请您仔细阅读本隐私政策，如您对本政策有任何疑问或建议，请随时联系我们。","一、收集的个人信息","（一）注册与登录信息","当您注册游戏账号时，我们可能会收集您的手机号码、电子邮箱地址、创建的用户名和密码等信息，用于创建和管理您的账号，确保您能够正常登录和使用游戏服务。","（二）游戏内行为信息","在您使用游戏的过程中，我们会收集您在游戏中的操作行为数据，例如游戏时长、游戏关卡进度、虚拟物品获取与使用情况等。这些信息有助于我们优化游戏体验，为您提供更个性化的服务。","（三）设备信息","我们可能会收集您的设备型号、操作系统版本、设备识别码（如 IMEI、MAC 地址）、屏幕分辨率等信息，以便适配不同设备，保障游戏的稳定运行和兼容性。","（四）位置信息","若您授权，我们会获取您的位置信息，主要用于提供基于位置的游戏服务或活动，例如附近的游戏玩家互动、特定区域的游戏任务等。","二、个人信息的使用","我们使用收集的个人信息来为您提供游戏及相关服务，包括但不限于账号管理、游戏功能实现、客户支持等。","分析您的游戏行为和偏好，以便为您提供个性化的游戏推荐、活动推送和广告展示，提升您的游戏体验。","用于游戏的安全防护和反作弊检测，保障游戏环境的公平性和安全性，维护您和其他用户的合法权益。","三、个人信息的存储","我们将在中华人民共和国境内存储您的个人信息。如果需要将您的个人信息传输至境外，我们会事先获得您的明确同意，并遵守相关法律法规的规定。","我们仅在为实现本隐私政策所述目的所必需的期限内保留您的个人信息，超出期限后，我们将对相关信息进行删除或匿名化处理。","四、个人信息的共享、转让与公开披露","我们不会向第三方共享、转让您的个人信息，除非获得您的明确同意或法律法规另有规定。","在某些情况下，我们可能会与合作伙伴（如游戏服务器提供商、支付服务提供商等）共享必要的个人信息，以提供完整的游戏服务，但我们会要求合作伙伴遵守严格的保密义务和数据保护措施。","我们仅在法律要求或保护火刀石科技及其他用户合法权益的情况下，才会公开披露您的个人信息。","五、个人信息的保护措施","我们采用安全技术和管理措施，保障您的个人信息安全，防止信息泄露、篡改和丢失。","对员工进行严格的保密培训，要求他们遵守保密义务，妥善处理和保护您的个人信息。","定期对我们的信息安全系统进行评估和改进，以应对不断变化的安全威胁。","六、您的权利","访问权：您有权访问您的个人信息，了解我们收集和使用您信息的情况。","更正权：如果您发现我们收集的您的个人信息不准确或不完整，您有权要求我们进行更正或补充。","删除权：在符合法律法规规定的情况下，您有权要求我们删除您的个人信息。","撤回同意权：您有权随时撤回您对我们收集和使用您个人信息的同意，但这可能会影响您继续使用某些游戏服务。","七、隐私政策的变更","我们可能会根据法律法规的变化、业务发展或其他原因对本隐私政策进行修改。修改后的隐私政策将在官方渠道公布，您继续使用游戏及相关服务即视为您同意接受修改后的隐私政策。","八、联系我们","如果您对本隐私政策有任何疑问、意见或建议，或者您需要行使您的权利，请通过以下方式联系我们：","[jimmyshi@huodaoshi.com]","我们将尽快处理您的问题，并在 15 个工作日内给予您答复。","感谢您对我们的信任与支持，我们将始终致力于保护您的个人信息安全！","","","公司名称：上海火刀石网络科技有限公司","地址:中国(上海)自由贸易试验区环科路515号509室","联系方式:jimmyshi@huodaoshi.com",""]}]],0,0,[],[],[]]
